[Killed] BlockStatement
src/products/products.service.ts:10:46
 export class ProductsService {
   constructor(private readonly productsRepository: ProductsRepository) {}
 
-  create(createProductDto: CreateProductDto) {
-    return this.productsRepository.create(createProductDto);
-  }
+  create(createProductDto: CreateProductDto) {}
 
   async update(id: number, updateProductDto: UpdateProductDto) {
killedBy: ProductsService create should create a new product
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"description": "Desc", "id": 1, "name": "Test", "sku": "123"}
Received: undefined

[NoCoverage] BlockStatement
src/products/products.service.ts:14:64
     return this.productsRepository.create(createProductDto);
   }
 
-  async update(id: number, updateProductDto: UpdateProductDto) {
-    const updated = await this.productsRepository.update(id, updateProductDto);
-    if (!updated) throw new NotFoundException(`Product #${id} not found`);
-    return updated;
-  }
+  async update(id: number, updateProductDto: UpdateProductDto) {}
 
   async remove(id: number) {

[NoCoverage] ConditionalExpression
src/products/products.service.ts:16:9
 
   async update(id: number, updateProductDto: UpdateProductDto) {
     const updated = await this.productsRepository.update(id, updateProductDto);
-    if (!updated) throw new NotFoundException(`Product #${id} not found`);
+    if (false) throw new NotFoundException(`Product #${id} not found`);
     return updated;
   }

[NoCoverage] BooleanLiteral
src/products/products.service.ts:16:9
 
   async update(id: number, updateProductDto: UpdateProductDto) {
     const updated = await this.productsRepository.update(id, updateProductDto);
-    if (!updated) throw new NotFoundException(`Product #${id} not found`);
+    if (updated) throw new NotFoundException(`Product #${id} not found`);
     return updated;
   }

[Killed] BlockStatement
src/products/products.service.ts:20:28
     return updated;
   }
 
-  async remove(id: number) {
-    const deleted = await this.productsRepository.delete(id);
-    if (!deleted) throw new NotFoundException(`Product #${id} not found`);
-    return { message: `Product #${id} removed successfully` };
-  }
+  async remove(id: number) {}
 
   findAll() {
killedBy: ProductsService remove should delete product successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Product #1 removed successfully"}
Received: undefined

[Killed] ConditionalExpression
src/products/products.service.ts:22:9
 
   async remove(id: number) {
     const deleted = await this.productsRepository.delete(id);
-    if (!deleted) throw new NotFoundException(`Product #${id} not found`);
+    if (true) throw new NotFoundException(`Product #${id} not found`);
     return { message: `Product #${id} removed successfully` };
   }
killedBy: ProductsService remove should delete product successfully
statusReason: NotFoundException: Product #1 not found

[Killed] ConditionalExpression
src/products/products.service.ts:22:9
 
   async remove(id: number) {
     const deleted = await this.productsRepository.delete(id);
-    if (!deleted) throw new NotFoundException(`Product #${id} not found`);
+    if (false) throw new NotFoundException(`Product #${id} not found`);
     return { message: `Product #${id} removed successfully` };
   }
killedBy: ProductsService remove should throw NotFoundException if product not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"message": "Product #999 removed successfully"}

[Killed] StringLiteral
src/products/products.service.ts:23:23
   async remove(id: number) {
     const deleted = await this.productsRepository.delete(id);
     if (!deleted) throw new NotFoundException(`Product #${id} not found`);
-    return { message: `Product #${id} removed successfully` };
+    return { message: `` };
   }
 
killedBy: ProductsService remove should delete product successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "message": "Product #1 removed successfully",
+   "message": "",

[Killed] BlockStatement
src/products/products.service.ts:26:13
     return { message: `Product #${id} removed successfully` };
   }
 
-  findAll() {
-    return this.productsRepository.findAll();
-  }
+  findAll() {}
 
   async findOne(id: number) {
killedBy: ProductsService findAll should return an array of products
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 1, "name": "P1"}, {"id": 2, "name": "P2"}]
Received: undefined

[Killed] BlockStatement
src/products/products.service.ts:30:29
     return this.productsRepository.findAll();
   }
 
-  async findOne(id: number) {
-    const product = await this.productsRepository.findOne(id);
-    if (!product) throw new NotFoundException(`Product #${id} not found`);
-    return product;
-  }
+  async findOne(id: number) {}
 }
 
killedBy: ProductsService findOne should return a product if found
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"id": 1, "name": "P1"}
Received: undefined

[Killed] BooleanLiteral
src/products/products.service.ts:32:9
 
   async findOne(id: number) {
     const product = await this.productsRepository.findOne(id);
-    if (!product) throw new NotFoundException(`Product #${id} not found`);
+    if (product) throw new NotFoundException(`Product #${id} not found`);
     return product;
   }
killedBy: ProductsService findOne should return a product if found
statusReason: NotFoundException: Product #1 not found

[Killed] ConditionalExpression
src/products/products.service.ts:32:9
 
   async findOne(id: number) {
     const product = await this.productsRepository.findOne(id);
-    if (!product) throw new NotFoundException(`Product #${id} not found`);
+    if (false) throw new NotFoundException(`Product #${id} not found`);
     return product;
   }
killedBy: ProductsService findOne should throw NotFoundException if not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null
